# Компьютер заблокирован. Вернёшь скейт - скажу код разблокировки!
# Введите код: 1005
# Компьютер заблокирован. Вернёшь скейт - скажу код разблокировки!
# Введите код: 7777
# Компьютер заблокирован. Вернёшь скейт - скажу код разблокировки!
# Введите код: 550
# Код верный, завершаю работу...

code = 564

while True:
    print('Компьютер заблокирован. Вернёшь скейт - скажу код разблокировки!')
    answer = int(input('Введите код: '))
    if answer == code:
        print('Спасибо за скейт, удаляю вирус 🦠')
        break