import math

print('Первый вариант 1.1 + 2.2 == 3.3')
if 1.1 + 2.2 == 3.3:
    print('равны')
else:
    print('не равны')

# Использую math.isclose() с rel_tol (относительная погрешность):
print('\nВторой вариант 1.1 + 2.2 == 3.3')
if math.isclose(1.1 + 2.2, 3.3, rel_tol=1e-9):  # Позволяет небольшую погрешность
    print('равны')
else:
    print('не равны')

print('\nТретий вариант 1.1 + 2.2 == 3.3')
if float(1.1 + 2.2) == float(3.3):
    print('равны')
else:
    print('не равны')

print('\nЧетвертый вариант 1.1 + 2.2 == 3.3')

a = 1.1
b = 2.2
c = a + b

if c == (a + b):
    print('равны')
else:
    print('не равны')

print('\nПятый вариант 1.1 + 2.2 == 3.3')

if int(1.1 * 10 + 2.2 * 10) == int(3.3 * 10):
    print('равны')
else:
    print('не равны')
