print('Задача 1. Язык математики')

# В первый же день на сайте отвалилась формула по расчёту рекламной метрики, и только Вася может её поправить.
# Часть программы с вводными данными представлена ниже, отдельно записана формула на математическом языке.

# Дана программа:

a = 8
b = 10
c = 12
d = 18
# Напишите расчёты для рекламной метрики.

# В переменной numerator сохраните результаты подсчётов числителя дроби.

numerator = (-3 + (a ** 2)) * b - (2 ** 3)

# В переменной denominator сохраните результаты подсчётов знаменателя дроби.

denominator = c - 2 * d

# В переменной result сохраните результат деления числителя на знаменатель.

result = numerator / denominator

# Выведите результат вычислений на экран.
print(result)