# Задача 1. Python!
# Напишите программу, которая выводит в отдельную строчку каждый символ фразы “Python!”.

text = 'Python'

for symbol in text:
    print(symbol)

