#Задача module_3. Следим за расписанием
num = int(input('Введите число: '))

if num % 2 == 0:
    print('Сегодня четное число. Иди на работу!')
else:
    print("Отдыхай, сегодня нечетный день")