# Задача module_3_(basic). Дружба

number = int(input("Введите число: "))
if number % 2 == 0:
    print('Число чётное')
else:
    print('Число нечетное')


# В маленьком городе в уютном кафе встретились два друга — Дима и Настя. Они обсуждали программирование: Дима признался, что ему тяжело даются условные операторы в Python, и Настя решила ему помочь.
#
# «Давай я покажу тебе пример кода, а ты постараешься найти в нём ошибку», — предложила Настя. Вскоре она подготовила короткий фрагмент программы и передала его Диме.
#
# Вот код, который написала Настя:
#
# number = int(input("Введите число: "))
# if number % 2 = 0.
#     print("Число чётное")
# Дима нашёл все ошибки, теперь попробуйте и вы.
#
# Эти задания не нужно отправлять на проверку.